src/Documents/MoneyTransfer.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>MoneyTransfer</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Cash</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Sender</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Wallets</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Recipient</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Wallets</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SumOfWriteoff</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SumIncome</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Expenditure</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Expenditures</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Details</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/MoneyTransfer/Forms/DocumentForm/Ext/Form/Module.bsl
// CLIENT PROCEDURES AND FUNCTIONS //

&AtClient
Procedure SumOfWriteoffOnChange(Item)
	CalculateTheAmountOfCapitalization();
EndProcedure

&AtClient
Procedure CalculateTheAmountOfCapitalization ()
	IF CurrencyReceipt <> CurrencyExpense Then
    Else 
		Object.SumIncome = Object.SumOfWriteoff;
	EndIf;
EndProcedure	

&AtClient
Procedure RecipientOnChange(Item)
	RefreshVisible();
EndProcedure

&AtClient
Procedure SenderOnChange(Item)
	RefreshVisible();
EndProcedure

// SERVER PROCEDURES AND FUNCTIONS //

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	IF Not ValueIsFilled(Object.Ref) Then
		RES = CommonModuleServer.GetDefaultValues(FormAttributeToValue("Object").Metadata().FullName(),"Sender,Recipient,Expenditure");
		FillPropertyValues(Object,Res);
	EndIf;
	RefreshVisible();
EndProcedure

&AtServer
Procedure RefreshVisible ()
	RefreshLabelsExpense();
	RefreshLabelsReceipt();
	//IF ValueIsFilled(Object.Sender.Currency) AND ValueIsFilled(Object.Recipient.Currency)
	//	Then Items.GroupAmountOfCapitalization.Enabled = Object.Sender.Currency <> Object.Recipient.Currency;
	//Else
	//	ElementsGruppoambienteAccessibility = True;
	//EndIF;
EndProcedure	

&AtClient
Procedure AfterWrite(WriteParameters)
	Notify("RecordDocument");
EndProcedure

// EXPENCE //

&AtServer
Procedure RefreshLabelsExpense ()
	CurrencyExpense    = Object.Sender.Currency;
	IF Not ValueIsFilled(CurrencyExpense) Then
		CurrencyExpense = Constants.MainCurrency.Get();
	EndIf;	
EndProcedure	

// INCOME //

&AtServer
Procedure RefreshLabelsReceipt ()
	CurrencyReceipt    = Object.Recipient.Currency;
	IF Not ValueIsFilled(CurrencyReceipt) Then
		CurrencyReceipt = Constants.MainCurrency.Get();
	EndIf;	
EndProcedure
